rails-lectures/web-app-theme/app/controllers/engineers_controller.rb

  def tag
     @engineers=Engineer.find_tagged_with( params[:id])
---
SELECT tags.id, tags.name, COUNT(*) AS count FROM "tags" INNER JOIN taggings ON tags.id = taggings.tag_id INNER JOIN engineers ON engineers.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Engineer') GROUP BY tags.id, tags.name HAVING COUNT(*) > 0

  def index
    @engineers=Engineer.paginate(:per_page => 10, :page => params[:page])
---
SELECT * FROM "engineers" LIMIT 10 OFFSET 0

  def show
    @engineer = Engineer.find(params[:id])
---
SELECT * FROM "engineers" WHERE ("engineers"."id" = 1)

  def edit
    @engineer = Engineer.find(params[:id])
---
SELECT * FROM "engineers" WHERE ("engineers"."id" = 1)

  def create
    @engineer = Engineer.new(params[:engineer])
 #   @engineer.project_assignments.each do |pa|
 #     puts "Adding project to pa #{pa.name}"
 #     pa.project = Project.find_by_name(pa.name)
 #   end

    respond_to do |format|
      if @engineer.save

        # TODO - Make sure to check for an empty resource here !
        @resource = Resource.new(params[:resource])
        @resource.engineer = @engineer
        @resource.save!
---
INSERT INTO "engineers" ("updated_at", "lname", "fname", "years_of_experience", "created_at") VALUES('2009-10-20 17:04:40', 'Weimer', 'Dan', 20, '2009-10-20 17:04:40')
INSERT INTO "resources" ("f_file_size", "updated_at", "engineer_id", "role", "f_content_type", "f_updated_at", "created_at", "f_file_name") VALUES(1546287, '2009-10-25 23:43:23', 8, 'new', 'image/jpeg', '2009-10-25 23:43:21', '2009-10-25 23:43:23', '231.jpg')

  def update
    @engineer = Engineer.find(params[:id])

    respond_to do |format|
      if @engineer.update_attributes(params[:engineer])

        @resource = Resource.new(params[:resource])
        @resource.engineer = @engineer
        @resource.save!
---
SELECT * FROM "engineers" WHERE ("engineers"."id" = 4)
INSERT INTO "resources" ("f_file_size", "updated_at", "engineer_id", "role", "f_content_type", "f_updated_at", "created_at", "f_file_name") VALUES(294066, '2009-10-25 23:39:59', 4, 'Role3', 'image/tiff', '2009-10-25 23:39:58', '2009-10-25 23:39:59', 'project2-sample-main-screen.tiff')

  def destroy
    @engineer = Engineer.find(params[:id])
    @engineer.destroy
---
SELECT * FROM "engineers" WHERE ("engineers"."id" = 3)
DELETE FROM "engineers" WHERE "id" = 3