rails-lectures/web-app-theme/app/controllers/projects_controller.rb

  def index
    @projects=Project.paginate(:per_page => 10, :page => params[:page])
---
SELECT * FROM "projects" LIMIT 10 OFFSET 0

  def show
    @project = Project.find(params[:id])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)