rails-lectures/ajax/app/controllers/engineers_controller.rb

SELECT * FROM "engineers" WHERE ("engineers"."lname" = 'Weimer') LIMIT 1
---
  def search_by_lname
      @engineer = Engineer.find_by_lname( params[:engineer][:lname])

SELECT tags.id, tags.name, COUNT(*) AS count FROM "tags" INNER JOIN taggings ON tags.id = taggings.tag_id INNER JOIN engineers ON engineers.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Engineer') GROUP BY tags.id, tags.name HAVING COUNT(*) > 0
---
  def tag
     @engineers=Engineer.find_tagged_with(params[:tag])

SELECT * FROM "engineers" WHERE ("engineers"."id" = 4)
---
  def get_matches
    puts "*** Executed get matches #{params[:id]}"
    @engineer = Engineer.find(params[:id])

SELECT * FROM "engineers" LIMIT 10 OFFSET 0
---
  def index
    @engineers=Engineer.paginate(:per_page => 10, :page => params[:page])

SELECT * FROM "engineers" WHERE ("engineers"."id" = 4)
---
  def show
    @engineer = Engineer.find(params[:id])