rails-lectures/view/skillmanager/app/controllers/engineers_controller.rb

SELECT * FROM "engineers"
---
  def index
    @engineers = Engineer.all

SELECT * FROM "engineers" WHERE ("engineers"."id" = 1)
---
  def show
    @engineer = Engineer.find(params[:id])

SELECT * FROM "engineers" WHERE ("engineers"."id" = 1)
---
  def edit
    @engineer = Engineer.find(params[:id])

SELECT * FROM "projects" WHERE ("projects"."name" = 'Mac OS/X') LIMIT 1
INSERT INTO "engineers" ("updated_at", "lname", "fname", "years_of_experience", "created_at") VALUES('2009-10-20 17:04:40', 'Weimer', 'Dan', 20, '2009-10-20 17:04:40')
INSERT INTO "project_assignments" ("project_id", "updated_at", "engineer_id", "sdate", "edate", "created_at") VALUES(NULL, '2009-10-20 19:02:54', 2, '2009-01-01', '2009-02-01', '2009-10-20 19:02:54')
---
  def create
    @engineer = Engineer.new(params[:engineer])
    @engineer.project_assignments.each do |pa|
      puts "Adding project to pa #{pa.name}"
      pa.project = Project.find_by_name(pa.name)
    end

    respond_to do |format|
      if @engineer.save

SELECT * FROM "engineers" WHERE ("engineers"."id" = 3)
DELETE FROM "engineers" WHERE "id" = 3
---
  def destroy
    @engineer = Engineer.find(params[:id])
    @engineer.destroy